# El tratamiendo de las variables categoricas

In [28]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression

In [29]:
df = pd.read_csv('../datasets/ecom-expense/Ecom Expense.csv')

In [30]:
df.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485

In [31]:
dummy_gender = pd.get_dummies(df['Gender'],prefix="Gender")
dummy_city = pd.get_dummies(df['City Tier'],prefix="City")

In [32]:
dummy_gender.head()

   Gender_Female  Gender_Male
0              1            0
1              1            0
2              0            1
3              1            0
4              1            0

In [33]:
dummy_city.head()

   City_Tier 1  City_Tier 2  City_Tier 3
0            1            0            0
1            0            1            0
2            0            1            0
3            1            0            0
4            0            1            0

In [34]:
column_names = df.columns.values.tolist()
column_names

['Transaction ID',
 'Age ',
 ' Items ',
 'Monthly Income',
 'Transaction Time',
 'Record',
 'Gender',
 'City Tier',
 'Total Spend']

In [35]:
df_new = df[column_names].join(dummy_gender)
column_names = df_new.columns.values.tolist()
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0

In [36]:
df_new = df_new[column_names].join(dummy_city)
column_names = df_new.columns.values.tolist()
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male,City_Tier 1,City_Tier 2,City_Tier 3
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0,1,0,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0,0,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1,0,1,0
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0,1,0,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0,0,1,0

In [59]:
feature_cols = [
 'Monthly Income',
 'Transaction Time',
 'Gender_Female',
 'Gender_Male',
 'City_Tier 1',
 'City_Tier 2',
 'City_Tier 3',
    'Record']

In [60]:
x = df_new[feature_cols]

In [61]:
y = df_new['Total Spend']

In [62]:
lm = LinearRegression()
lm.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [63]:
lm.intercept_, lm.coef_

(-79.41713030136816,
 array([ 1.47538980e-01,  1.54946125e-01, -1.31025013e+02,  1.31025013e+02,
         7.67643260e+01,  5.51389743e+01, -1.31903300e+02,  7.72233446e+02]))

In [64]:
list(zip(feature_cols, lm.coef_))

[('Monthly Income', 0.14753898049205733),
 ('Transaction Time', 0.15494612549589615),
 ('Gender_Female', -131.02501325554607),
 ('Gender_Male', 131.0250132555465),
 ('City_Tier 1', 76.7643260104955),
 ('City_Tier 2', 55.138974309232296),
 ('City_Tier 3', -131.90330031972775),
 ('Record', 772.2334457445637)]

In [65]:
# R Cuadrado
lm.score(x,y)

0.9179923586131016

### El modelo General quedaria

* Total Spend = -79.41713030136816 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 + 'Gender_Female' * -131.02501325554607 + 'Gender_Male'* 131.0250132555465 + 'City_Tier 1' * 76.7643260104955 + 'City_Tier 2' * 55.138974309232296 + 'City_Tier 3' * -131.90330031972775 + 'Record' * 772.2334457445637

### Modelos con valores categoricos
**Para crear los modelos predictivos se toma el modelo general y se eliminan las columnas que queremos predecir solo dejamos sus coeficientes**

    * Si es hombre y vive en CT1: Total Spend = -79.41713030136816 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 + 131.0250132555465 + 76.7643260104955 + 'Record' * 772.2334457445637
    * Si es hombre y vive en CT2: Total Spend = -79.41713030136816 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 + 131.0250132555465 + 55.138974309232296 + 'Record' * 772.2334457445637
    * Si es hombre y vive en CT3: Total Spend = -79.41713030136816 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 + 131.0250132555465 - 131.90330031972775 + 'Record' * 772.2334457445637
    
    * Si es mujer y vive en CT1: Total Spend = -79.41713030136816 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 - 131.0250132555465 + 76.7643260104955 + 'Record' * 772.2334457445637
    * Si es mujer y vive en CT2: Total Spend = -79.41713030136816 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 - 131.0250132555465 + 55.138974309232296 + 'Record' * 772.2334457445637
    * Si es mujer y vive en CT3: Total Spend = -79.41713030136816 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 - 131.0250132555465 - 131.90330031972775 + 'Record' * 772.2334457445637
    
### Para abreviar los modelos se deben agrupar los numeros sin multiplicadores (sumas y restas)

    * Si es hombre y vive en CT1: Total Spend =  128.372208965 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 + 'Record' * 772.2334457445637
    * Si es hombre y vive en CT2: Total Spend = 106.746857263 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 + 'Record' * 772.2334457445637
    * Si es hombre y vive en CT3: Total Spend = -80.2954173655 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 + 'Record' * 772.2334457445637
    
    * Si es mujer y vive en CT1: Total Spend = -133.677817546 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 + 'Record' * 772.2334457445637
    * Si es mujer y vive en CT2: Total Spend = -155.303169248 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 + 'Record' * 772.2334457445637
    * Si es mujer y vive en CT3: Total Spend = -342.345443877 + 'Monthly Income' * 0.14753898049205733 + 'Transaction Time' * 0.15494612549589615 + 'Record' * 772.2334457445637

In [71]:
df_new['prediction'] = -79.41713030136816 + df_new['Monthly Income'] * 0.14753898049205733 + df_new['Transaction Time'] * 0.15494612549589615 +df_new['Gender_Female'] * (-131.02501325554607) + df_new['Gender_Male'] * 131.0250132555465 + df_new['City_Tier 1'] * 76.7643260104955 + df_new['City_Tier 2'] * 55.138974309232296 + df_new['City_Tier 3'] * (-131.90330031972775) + df_new['Record'] * 772.2334457445637

In [72]:
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male,City_Tier 1,City_Tier 2,City_Tier 3,prediction
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0,1,0,0,4903.696720
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0,0,1,0,4799.434826
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1,0,1,0,5157.082504
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0,1,0,0,8068.012996
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0,0,1,0,3581.980335

In [88]:
SSD = np.sum((df_new['prediction']-df["Total Spend"])**2)
SSD

1517733985.3408165

In [89]:
RSE = np.sqrt(SSD/(len(df_new) - len(column_names) -1) )
RSE

804.157810990426

In [90]:
mean = np.mean(df["Total Spend"])
mean

6163.176415976714

In [91]:
error = RSE/mean
error

0.1304778180461976

## Eliminar variables dummy redundantes

In [94]:
dummy_gender = pd.get_dummies(df['Gender'],prefix ="Gender").iloc[:,1:]
dummy_gender.head()

   Gender_Male
0            0
1            0
2            1
3            0
4            0

In [95]:
dummy_city = pd.get_dummies(df['City Tier'],prefix ="City").iloc[:,1:]
dummy_city.head()

   City_Tier 2  City_Tier 3
0            0            0
1            1            0
2            1            0
3            0            0
4            1            0

In [98]:
column_names = df.columns.values.tolist()
df_new = df[column_names].join(dummy_gender)
column_names = df_new.columns.values.tolist()
df_new = df_new[column_names].join(dummy_city)
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Male,City_Tier 2,City_Tier 3
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,0,0,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,0,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,1,1,0
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,0,0,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,0,1,0

In [102]:
feature_cols = [
 'Monthly Income',
 'Transaction Time',
 'Gender_Male',
 'City_Tier 2',
 'City_Tier 3',
    'Record']

In [103]:
x = df_new[feature_cols]
y = df['Total Spend']
lm.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [104]:
lm.intercept_, lm.coef_

(-133.67781754642147,
 array([ 1.47538980e-01,  1.54946125e-01,  2.62050027e+02, -2.16253517e+01,
        -2.08667626e+02,  7.72233446e+02]))

In [105]:
list(zip(feature_cols, lm.coef_))

[('Monthly Income', 0.14753898049205735),
 ('Transaction Time', 0.15494612549589748),
 ('Gender_Male', 262.05002651109527),
 ('City_Tier 2', -21.625351701262765),
 ('City_Tier 3', -208.66762633022327),
 ('Record', 772.2334457445639)]

In [107]:
lm.score(x,y)

0.9179923586131016

Coeficientes con todas las variables en el modelo
* ('Monthly Income', 0.14753898049205733),
* ('Transaction Time', 0.15494612549589615),
* ('Gender_Female', -131.02501325554607),
* ('Gender_Male', 131.0250132555465),
* ('City_Tier 1', 76.7643260104955),
* ('City_Tier 2', 55.138974309232296),
* ('City_Tier 3', -131.90330031972775),
* ('Record', 772.2334457445637)

Coeficintes tras enmascarar las variables dummy pertinentes

* ('Monthly Income', 0.14753898049205735),
* ('Transaction Time', 0.15494612549589748),
* ('Gender_Male', 262.05002651109527),
* ('City_Tier 2', -21.625351701262765),
* ('City_Tier 3', -208.66762633022327),
* ('Record', 772.2334457445639)

Los cambios se reflejan en 
* Gender_Male: 
    * antes -> 131.08, despues -> 262.05 = (131.02-(-131.02))
* Gender_Female: 
    * antes -> 131.08, despues -> 0
* CT1: 
    * antes -> 76.76, despues -> 0
* CT2: 
    * antes -> 55.14, despues -> -21.62 = (55.14 - 76.76)
* CT3: 
    * antes -> -131.90, despues -> -208.66 = (-131.90 - 76.76)